<?php
return [
    0 => '成功',

    1000=>'通用错误码',
    1001=>'服务器错误',
    1002=>'签名错误',
    1003=>'Token错误',
    1004=>'Token过期',
    1005=>'重放请求错误',
    1006=>'系统繁忙',
    1007=>'数据非法',
    1008=>'数据不存在',
    1009=>'操作非法',
    1010=>'第三方调用错误',
    1011=>'路由错误',
    1012=>'请求方式错误',
    1013=>'账号未登录',



    /***
     * 1100 - 1199 定义用户操作类 需弹窗提示错误
     */

    1101 => '验证码错误',
    1102 => '手机号码不能为空',
    1103 => '手机号码格式错误',
    1104 => '该评论不存在或已被删除！',
    1105 => '该书不存在或已下架！',
    1106 => '服务繁忙，请稍后再试！',
    1107 => '您已经点赞过了！',
    1108 => '您已经点赞过了！',
    1109 => '您发言太快了！',
    1110 => '一次性下载章节过多最大值100章',
    1111 => '请输入正确的手机号',
    1112 => '不能删除别人的评论',
    1113 => '你已被管理员禁止评论',

    /***
     * 账号与权限相关：1200-1299
     */
    1200=>'账号不存在',
    1201=>'账号状态异常',
    1202=>'账号权限错误',
    1203=>'密码错误',
    1204=>'账号被踢出登录状态',
    1205=>'账号已在其他设备登录',


    401 => '未登录',
    402 => 'token无效',
    403 => 'token过期',
];

